//
//  main.cpp
//  1001 Exponentiation
//
//  Created by Haoyu Guo on 20/01/2017.
//  Copyright © 2017 Haoyu Guo. All rights reserved.
//
/*
 Sample Input
 
 95.123 12
 0.4321 20
 5.1234 15
 6.7592  9
 98.999 10
 1.0100 12
 Sample Output
 
 548815620517731830194541.899025343415715973535967221869852721
 .00000005148554641076956121994511276767154838481760200726351203835429763013462401
 43992025569.928573701266488041146654993318703707511666295476720493953024
 29448126.764121021618164430206909037173276672
 90429072743629540498.107596019456651774561044010001
 1.126825030d131969720661201
 */
/*
 Description:    基本思想很简单：把double型当做字符串进行读入，然后提取出double的各个数到int型
 数组中，模拟手算进行大整数乘法。
 注意：要事先计算出小数点的位置，输出的时候加以控制即可！
 */
#include <iostream>
#include <string>
#include<cstdio>
using namespace std;
void multiply(string a,string b)//两个多项式相乘的表达式
{
    
    
    
}
int main()
{
    
    
    
    return 0;
}
































